const data = {
    objects: [
        {
            id: 1,
            uuid: "0000-0000-0000-0000-0000",
            title: "Аудитория 1",
            isSelected: true,
            type: "aud",
            coordinates: [[292,143],[1032,140],[1032,149],[1043,149],[1044,444],[242,444]]

        },
        {
            id: 2,
            uuid: "0000-0000-0000-0000-0000",
            title: "Аудитория 2",
            isSelected: false,
            type: "aud",
            coordinates: [[224,554],[239,464],[333,465],[331,554]]

        },
        {
            id: 3,
            uuid: "0000-0000-0000-0000-0000",
            title: "Аудитория 3",
            isSelected: false,
            type: "aud",
            coordinates: [[582,463],[813,463],[813,552],[582,552]],

        },
        {
            id: 4,
            uuid: "0000-0000-0000-0000-0000",
            title: "Аудитория 4",
            isSelected: false,
            type: "aud",
            coordinates: [[825,463],[1050,460],[1050,551],[824,551]],

        },
        {
            id: 5,
            uuid: "0000-0000-0000-0000-0000",
            title: "Аудитория 5",
            isSelected: false,
            type: "aud",
            coordinates: [[1055,163],[1279,162],[1280,465],[1204,464],[1204,326],[1055,327]],

        },
        {
            id: 6,
            uuid: "0000-0000-0000-0000-0000",
            title: "Аудитория 6",
            isSelected: false,
            type: "aud",
            coordinates: [[1115,337],[1193,337],[1194,464],[1057,464],[1056,398],[1154,397],[1154,389],[1116,388]],

        },
        {
            id: 7,
            uuid: "0000-0000-0000-0000-0000",
            title: "Аудитория 7",
            isSelected: false,
            type: "aud",
            coordinates: [[1295,463],[1368,464],[1368,431],[1396,431],[1396,443],[1432,444],[1432,464],[1518,463],[1518,449],[1537,449],[1545,453],[1648,453],[1583,140],[1534,139],[1535,147],[1515,147],[1515,139],[1296,140],[1293,150]],

        },
        {
            id: 8,
            uuid: "0000-0000-0000-0000-0000",
            title: "Аудитория 8",
            isSelected: false,
            type: "aud",
            coordinates: [[1625,259],[1910,258],[1874,461],[1665,462]],

        },
        {
            id: 9,
            uuid: "0000-0000-0000-0000-0000",
            title: "Аудитория 9",
            isSelected: false,
            type: "aud",
            coordinates: [[1668,473],[1872,471],[1830,701],[1713,701]],

        },
        {
            id: 10,
            uuid: "0000-0000-0000-0000-0000",
            title: "Аудитория 10",
            isSelected: false,
            type: "aud",
            coordinates: [[1834,776],[1946,776],[1996,498],[1888,478]],

        },
        {
            id: 11,
            uuid: "0000-0000-0000-0000-0000",
            title: "Аудитория 11",
            isSelected: true,
            type: "aud",
            coordinates: [[2060,774],[2014,486],[1974,478],[2036,129],[2050,130],[2076,126],[2076,116],[2180,116],[2181,122],[2192,122],[2192,130],[2202,130],[2264,478],[2224,485],[2176,775]],

        },
        {
            id: 12,
            uuid: "0000-0000-0000-0000-0000",
            title: "Аудитория 12",
            isSelected: false,
            type: "aud",
            coordinates: [[2241,498],[2352,478],[2405,774],[2295,775]],

        },
        {
            id: 13,
            uuid: "0000-0000-0000-0000-0000",
            title: "Аудитория 13",
            isSelected: false,
            type: "aud",
            coordinates: [[2418,774],[2522,775],[2615,255],[2328,255]]

        },
        {
            id: 14,
            uuid: "0000-0000-0000-0000-0001",
            title: "Коридор 1",
            isSelected: true,
            type: "hall",
            coordinates: [[2602,414],[2774,412],[2775,375],[2905,375],[2906,412],[2954,412],[2952,133],[2654,135]]

        },
        {
            id: 15,
            uuid: "0000-0000-0000-0000-0001",
            title: "Коридор 2",
            isSelected: true,
            type: "hall",
            coordinates: [[2968,419],[3149,418],[3149,384],[3280,382],[3280,418],[3442,419],[3441,138],[3432,140],[3431,132],[2972,132],[2972,139],[2965,138]]

        },
        {
            id: 16,
            uuid: "0000-0000-0000-0000-0001",
            title: "Коридор 3",
            isSelected: true,
            type: "hall",
            coordinates: [[3454,411],[3664,411],[3664,226],[3630,225],[3630,172],[3456,172]]

        },
        {
            id: 17,
            uuid: "0000-0000-0000-0000-0001",
            title: "Коридор 3",
            isSelected: true,
            type: "hall",
            coordinates: [[3720,460],[3720,441],[3693,441],[3693,230],[3775,230],[3810,441],[3785,440],[3786,460]]

        },
        {
            id: 18,
            uuid: "0000-0000-0000-0000-0001",
            title: "Коридор 3",
            isSelected: true,
            type: "hall",
            coordinates: [[3829,603],[4025,602],[4059,459],[4030,459],[4030,440],[4035,436],[4045,350],[3948,350],[3948,356],[3930,357],[3929,351],[3808,352],[3822,439],[3826,444],[3825,460],[3799,461]]

        },
        {
            id: 19,
            uuid: "0000-0000-0000-0000-0001",
            title: "Коридор 3",
            isSelected: true,
            type: "hall",
            coordinates: [[3907,788],[3869,788],[3831,612],[4023,612],[3995,730],[3938,729],[3937,669],[3907,669]]

        },
        {
            id: 20,
            uuid: "0000-0000-0000-0000-0001",
            title: "Коридор 3",
            isSelected: true,
            type: "hall",
            coordinates: [[3692,218],[3773,219],[3759,139],[3752,139],[3752,133],[3692,133]]

        },
        {
            id: 21,
            uuid: "0000-0000-0000-0000-0001",
            title: "Коридор 3",
            isSelected: true,
            type: "hall",
            coordinates: [[3785,217],[4063,216],[4074,139],[4071,132],[3933,131],[3933,139],[3913,139],[3913,132],[3773,133],[3771,140]]

        },
        {
            id: 22,
            uuid: "0000-0000-0000-0000-0001",
            title: "Коридор 3",
            isSelected: true,
            type: "hall",
            coordinates: [[4087,139],[4091,132],[4148,133],[4148,217],[4077,217]]

        },
        {
            id: 23,
            uuid: "0000-0000-0000-0000-0001",
            title: "Коридор 3",
            isSelected: true,
            type: "hall",
            coordinates: [[4046,439],[4071,439],[4072,457],[4126,459],[4126,439],[4149,439],[4148,231],[4075,231]]

        },
        {
            id: 24,
            uuid: "0000-0000-0000-0000-0001",
            title: "Коридор 3",
            isSelected: true,
            type: "hall",
            coordinates: [[4150,138],[4168,139],[4168,132],[4394,131],[4395,423],[4152,424]]

        },
        {
            id: 25,
            uuid: "0000-0000-0000-0000-0001",
            title: "Коридор 3",
            isSelected: true,
            type: "hall",
            coordinates: [[4429,424],[4405,384],[4405,138],[4414,138],[4413,130],[4630,130],[4630,138],[4637,138],[4637,424]]

        },
        {
            id: 26,
            uuid: "0000-0000-0000-0000-0001",
            title: "Коридор 3",
            isSelected: true,
            type: "hall",
            coordinates: [[4647,423],[4884,422],[4883,137],[4877,137],[4877,130],[4651,129],[4651,137],[4644,136]]

        },
        {
            id: 27,
            uuid: "0000-0000-0000-0000-0001",
            title: "Коридор 3",
            isSelected: true,
            type: "hall",
            coordinates: [[5118,421],[5118,136],[5116,128],[4897,128],[4898,136],[4892,136],[4893,422]]

        },
        {
            id: 28,
            uuid: "0000-0000-0000-0000-0001",
            title: "Коридор 3",
            isSelected: true,
            type: "hall",
            coordinates: [[5136,129],[5183,129],[5243,421],[5129,421],[5129,135],[5136,135]]

        },
        {
            id: 29,
            uuid: "0000-0000-0000-0000-0001",
            title: "Коридор 3",
            isSelected: true,
            type: "hall",
            coordinates: [[5224,245],[5498,243],[5469,450],[5383,450],[5382,439],[5362,439],[5362,450],[5265,451]]

        },
        {
            id: 30,
            uuid: "0000-0000-0000-0000-0001",
            title: "Коридор 3",
            isSelected: true,
            type: "hall",
            coordinates: [[5267,462],[5467,461],[5436,688],[5313,688]]

        },
        {
            id: 31,
            uuid: "0000-0000-0000-0000-0001",
            title: "Коридор 3",
            isSelected: true,
            type: "hall",
            coordinates: [[5442,760],[5555,760],[5597,499],[5481,482]]

        },
        {
            id: 32,
            uuid: "0000-0000-0000-0000-0001",
            title: "Коридор 3",
            isSelected: true,
            type: "hall",
            coordinates: [[5680,767],[5803,766],[5846,478],[5872,473],[5804,141],[5779,140],[5778,127],[5659,127],[5659,137],[5636,137],[5584,475],[5622,482]]

        },
        {
            id: 33,
            uuid: "0000-0000-0000-0000-0001",
            title: "Коридор 3",
            isSelected: true,
            type: "hall",
            coordinates: [[5868,495],[5963,477],[6024,759],[5919,759]]

        },
        {
            id: 34,
            uuid: "0000-0000-0000-0000-0001",
            title: "Коридор 3",
            isSelected: true,
            type: "hall",
            coordinates: [[5931,241],[6200,241],[6175,449],[6085,449],[6085,438],[6065,437],[6064,449],[5975,449]]

        },
        {
            id: 35,
            uuid: "0000-0000-0000-0000-0001",
            title: "Коридор 3",
            isSelected: true,
            type: "hall",
            coordinates: [[5977,458],[6174,458],[6149,671],[6023,671]]

        },
    ]
};

const svg = document.getElementById("svg");

for (object of data.objects) {
    let polygon = document.createElementNS("http://www.w3.org/2000/svg", "polygon");
    for (dots of object.coordinates) {
        let point = svg.createSVGPoint();
        point.x = dots[0];
        point.y = dots[1];
        polygon.points.appendItem(point);
    }
    if (object.isSelected) {
        object.type === 'aud'
        ? polygon.setAttribute("class", "isSelectedAud")
        : polygon.setAttribute("class", "isSelectedHall");
    }

    polygon.setAttribute("id", object.id);
    svg.appendChild(polygon);
}